Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20/atdf/ATSAMD20E14.atdf
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  <module name="SystemControl" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register offset="0x00000d00" size="4" name="CPUID" initval="0x410CC601" caption="CPUID Base Register">
          <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
          <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
          <bitfield mask="0x000f0000" name="ARCHITECTURE" caption="Constant that defines the architecture of the processor"/>
          <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
          <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
        </register>
        <register offset="0x00000d04" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
          <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
          <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="no description available"/>
          <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="no description available"/>
          <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="no description available"/>
          <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="no description available"/>
          <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="no description available"/>
        </register>
        <register offset="0x00000d08" size="4" name="VTOR" initval="0" caption="Vector Table Offset Register">
          <bitfield mask="0xffffff80" name="TBLOFF" caption="Vector table base offset"/>
        </register>
        <register offset="0x00000d0c" size="4" name="AIRCR" initval="0xFA050000" caption="Application Interrupt and Reset Control Register">
          <bitfield mask="0x00000002" name="VECTCLRACTIVE" caption="no description available"/>
          <bitfield mask="0x00000004" name="SYSRESETREQ" values="SYSRESETREQ" caption="no description available"/>
          <bitfield mask="0x00008000" name="ENDIANNESS" values="ENDIANNESS" caption="no description available"/>
          <bitfield mask="0xffff0000" name="VECTKEY" caption="Register key"/>
        </register>
        <register offset="0x00000d10" size="4" name="SCR" initval="0" caption="System Control Register">
          <bitfield mask="0x00000002" name="SLEEPONEXIT" values="SLEEPONEXIT" caption="no description available"/>
          <bitfield mask="0x00000004" name="SLEEPDEEP" values="SLEEPDEEP" caption="no description available"/>
          <bitfield mask="0x00000010" name="SEVONPEND" values="SEVONPEND" caption="no description available"/>
        </register>
        <register offset="0x00000d14" size="4" name="CCR" initval="0x00000204" caption="Configuration and Control Register">
          <bitfield mask="0x00000008" name="UNALIGN_TRP" values="UNALIGN_TRP" caption="Enables unaligned access traps"/>
          <bitfield mask="0x00000200" name="STKALIGN" values="STKALIGN" caption="Indicates stack alignment on exception entry"/>
        </register>
        <register offset="0x00000d1c" size="4" name="SHPR2" initval="0" caption="System Handler Priority Register 2">
          <bitfield mask="0xff000000" name="PRI_11" caption="Priority of system handler 11, SVCall"/>
        </register>
        <register offset="0x00000d20" size="4" name="SHPR3" initval="0" caption="System Handler Priority Register 3">
          <bitfield mask="0x00ff0000" name="PRI_14" caption="Priority of system handler 14, PendSV"/>
          <bitfield mask="0xff000000" name="PRI_15" caption="Priority of system handler 15, SysTick exception"/>
        </register>
      </register-group>
      <value-group name="PENDSTCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the SysTick exception"/>
      </value-group>
      <value-group name="PENDSTSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: SysTick exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes SysTick exception state to pending; read: SysTick exception is pending"/>
      </value-group>
      <value-group name="PENDSVCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the PendSV exception"/>
      </value-group>
      <value-group name="PENDSVSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: PendSV exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes PendSV exception state to pending; read: PendSV exception is pending"/>
      </value-group>
      <value-group name="NMIPENDSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: NMI exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes NMI exception state to pending; read: NMI exception is pending"/>
      </value-group>
